{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 1, 16], "name": "conv2d_57/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_57/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 16, 32], "name": "conv2d_58/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_58/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 32, 64], "name": "conv2d_59/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_59/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 64, 128], "name": "conv2d_60/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_60/bias"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 128], "name": "conv2d_61/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_61/bias"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 128], "name": "conv2d_62/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_62/bias"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 128], "name": "conv2d_63/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_63/bias"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 128], "name": "conv2d_64/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_64/bias"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 128], "name": "conv2d_transpose_40/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_40/bias"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 256], "name": "conv2d_transpose_41/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_41/bias"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 256], "name": "conv2d_transpose_42/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_42/bias"}]}, {"paths": ["group12-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 128, 256], "name": "conv2d_transpose_43/kernel"}, {"dtype": "float32", "shape": [128], "name": "conv2d_transpose_43/bias"}]}, {"paths": ["group13-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 64, 256], "name": "conv2d_transpose_44/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_transpose_44/bias"}]}, {"paths": ["group14-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 32, 128], "name": "conv2d_transpose_45/kernel"}, {"dtype": "float32", "shape": [32], "name": "conv2d_transpose_45/bias"}]}, {"paths": ["group15-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 16, 64], "name": "conv2d_transpose_46/kernel"}, {"dtype": "float32", "shape": [16], "name": "conv2d_transpose_46/bias"}]}, {"paths": ["group16-shard1of1"], "weights": [{"dtype": "float32", "shape": [4, 4, 1, 32], "name": "conv2d_transpose_47/kernel"}, {"dtype": "float32", "shape": [1], "name": "conv2d_transpose_47/bias"}]}, {"paths": ["group17-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_de_bn_1_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_1_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_1_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_1_6/moving_variance"}]}, {"paths": ["group18-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_de_bn_2_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_2_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_2_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_2_6/moving_variance"}]}, {"paths": ["group19-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_de_bn_3_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_3_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_3_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_3_6/moving_variance"}]}, {"paths": ["group20-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_de_bn_4_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_4_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_4_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_de_bn_4_6/moving_variance"}]}, {"paths": ["group21-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "gen_de_bn_5_6/gamma"}, {"dtype": "float32", "shape": [64], "name": "gen_de_bn_5_6/beta"}, {"dtype": "float32", "shape": [64], "name": "gen_de_bn_5_6/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "gen_de_bn_5_6/moving_variance"}]}, {"paths": ["group22-shard1of1"], "weights": [{"dtype": "float32", "shape": [32], "name": "gen_de_bn_6_6/gamma"}, {"dtype": "float32", "shape": [32], "name": "gen_de_bn_6_6/beta"}, {"dtype": "float32", "shape": [32], "name": "gen_de_bn_6_6/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "gen_de_bn_6_6/moving_variance"}]}, {"paths": ["group23-shard1of1"], "weights": [{"dtype": "float32", "shape": [16], "name": "gen_de_bn_7_6/gamma"}, {"dtype": "float32", "shape": [16], "name": "gen_de_bn_7_6/beta"}, {"dtype": "float32", "shape": [16], "name": "gen_de_bn_7_6/moving_mean"}, {"dtype": "float32", "shape": [16], "name": "gen_de_bn_7_6/moving_variance"}]}, {"paths": ["group24-shard1of1"], "weights": [{"dtype": "float32", "shape": [32], "name": "gen_en_bn_2_6/gamma"}, {"dtype": "float32", "shape": [32], "name": "gen_en_bn_2_6/beta"}, {"dtype": "float32", "shape": [32], "name": "gen_en_bn_2_6/moving_mean"}, {"dtype": "float32", "shape": [32], "name": "gen_en_bn_2_6/moving_variance"}]}, {"paths": ["group25-shard1of1"], "weights": [{"dtype": "float32", "shape": [64], "name": "gen_en_bn_3_6/gamma"}, {"dtype": "float32", "shape": [64], "name": "gen_en_bn_3_6/beta"}, {"dtype": "float32", "shape": [64], "name": "gen_en_bn_3_6/moving_mean"}, {"dtype": "float32", "shape": [64], "name": "gen_en_bn_3_6/moving_variance"}]}, {"paths": ["group26-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_en_bn_4_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_4_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_4_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_4_6/moving_variance"}]}, {"paths": ["group27-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_en_bn_5_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_5_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_5_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_5_6/moving_variance"}]}, {"paths": ["group28-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_en_bn_6_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_6_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_6_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_6_6/moving_variance"}]}, {"paths": ["group29-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_en_bn_7_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_7_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_7_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_7_6/moving_variance"}]}, {"paths": ["group30-shard1of1"], "weights": [{"dtype": "float32", "shape": [128], "name": "gen_en_bn_8_6/gamma"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_8_6/beta"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_8_6/moving_mean"}, {"dtype": "float32", "shape": [128], "name": "gen_en_bn_8_6/moving_variance"}]}], "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 1], "name": "unet_input"}, "name": "unet_input"}, {"class_name": "Conv2D", "inbound_nodes": [[["unet_input", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_57", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_57"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["conv2d_57", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_43", "trainable": true}, "name": "leaky_re_lu_43"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_43", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_58", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_58"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_58", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_2", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_2"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_2", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_44", "trainable": true}, "name": "leaky_re_lu_44"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_44", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_59", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_59"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_59", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_3", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_3"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_3", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_45", "trainable": true}, "name": "leaky_re_lu_45"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_45", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_60", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_60"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_4", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_4"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_4", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_46", "trainable": true}, "name": "leaky_re_lu_46"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_46", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_61", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_61"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_5", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_5"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_5", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_47", "trainable": true}, "name": "leaky_re_lu_47"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_47", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_62", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_62"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_6"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_6", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_48", "trainable": true}, "name": "leaky_re_lu_48"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_48", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_63", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_63"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_63", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_7"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["gen_en_bn_7", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "name": "leaky_re_lu_49", "trainable": true}, "name": "leaky_re_lu_49"}, {"class_name": "Conv2D", "inbound_nodes": [[["leaky_re_lu_49", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_64", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_64"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_64", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_en_bn_8", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_en_bn_8"}, {"class_name": "Activation", "inbound_nodes": [[["gen_en_bn_8", 0, 0, {}]]], "config": {"name": "activation_53", "trainable": true, "activation": "relu"}, "name": "activation_53"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_53", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_40", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_40"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_40", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["gen_de_bn_1", 0, 0, {}], ["gen_en_bn_7", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_43", "trainable": true}, "name": "concatenate_43"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_43", 0, 0, {}]]], "config": {"name": "activation_54", "trainable": true, "activation": "relu"}, "name": "activation_54"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_54", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_41", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_41"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_41", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_2", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_2"}, {"class_name": "Dropout", "inbound_nodes": [[["gen_de_bn_2", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_19", "trainable": true, "seed": null}, "name": "dropout_19"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_19", 0, 0, {}], ["gen_en_bn_6", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_44", "trainable": true}, "name": "concatenate_44"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_44", 0, 0, {}]]], "config": {"name": "activation_55", "trainable": true, "activation": "relu"}, "name": "activation_55"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_55", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_42", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_42"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_42", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_3", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_3"}, {"class_name": "Dropout", "inbound_nodes": [[["gen_de_bn_3", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_20", "trainable": true, "seed": null}, "name": "dropout_20"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_20", 0, 0, {}], ["gen_en_bn_5", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_45", "trainable": true}, "name": "concatenate_45"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_45", 0, 0, {}]]], "config": {"name": "activation_56", "trainable": true, "activation": "relu"}, "name": "activation_56"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_56", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_43", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_43"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_43", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_4", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_4"}, {"class_name": "Dropout", "inbound_nodes": [[["gen_de_bn_4", 0, 0, {}]]], "config": {"noise_shape": null, "rate": 0.5, "name": "dropout_21", "trainable": true, "seed": null}, "name": "dropout_21"}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_21", 0, 0, {}], ["gen_en_bn_4", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_46", "trainable": true}, "name": "concatenate_46"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_46", 0, 0, {}]]], "config": {"name": "activation_57", "trainable": true, "activation": "relu"}, "name": "activation_57"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_57", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_44", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_44"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_44", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_5", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_5"}, {"class_name": "Concatenate", "inbound_nodes": [[["gen_de_bn_5", 0, 0, {}], ["gen_en_bn_3", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_47", "trainable": true}, "name": "concatenate_47"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_47", 0, 0, {}]]], "config": {"name": "activation_58", "trainable": true, "activation": "relu"}, "name": "activation_58"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_58", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_45", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_45"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_45", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_6", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_6"}, {"class_name": "Concatenate", "inbound_nodes": [[["gen_de_bn_6", 0, 0, {}], ["gen_en_bn_2", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_48", "trainable": true}, "name": "concatenate_48"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_48", 0, 0, {}]]], "config": {"name": "activation_59", "trainable": true, "activation": "relu"}, "name": "activation_59"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_59", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_46", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_46"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_transpose_46", 0, 0, {}]]], "config": {"gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "gen_de_bn_7", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "axis": -1}, "name": "gen_de_bn_7"}, {"class_name": "Concatenate", "inbound_nodes": [[["gen_de_bn_7", 0, 0, {}], ["conv2d_57", 0, 0, {}]]], "config": {"axis": 3, "name": "concatenate_49", "trainable": true}, "name": "concatenate_49"}, {"class_name": "Activation", "inbound_nodes": [[["concatenate_49", 0, 0, {}]]], "config": {"name": "activation_60", "trainable": true, "activation": "relu"}, "name": "activation_60"}, {"class_name": "Conv2DTranspose", "inbound_nodes": [[["activation_60", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_47", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_size": [4, 4], "activation": "linear", "use_bias": true}, "name": "conv2d_transpose_47"}], "output_layers": [["conv2d_transpose_47", 0, 0]], "name": "unet_generator", "input_layers": [["unet_input", 0, 0]]}}, "training_config": {"loss": "DSSIMObjective", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-07, "lr": 0.0010000000474974513, "decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false}}, "metrics": ["mse", "DSSIMObjective"], "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.4"}}